#### Handling Categorical Features :

##### 1. One Hot encoding :

In [25]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("titanic.csv",usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [3]:
pd.get_dummies(df).head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [4]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [5]:
df=pd.read_csv("titanic.csv",usecols=['Embarked'])
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [6]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [7]:
df.dropna(inplace=True)

In [8]:
pd.get_dummies(df).head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [9]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [15]:
df=pd.read_csv("mercedes.csv",usecols=['X0','X1','X2','X3','X4','X5','X6'])
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [17]:
for i in df.columns:
    print(df[i].value_counts()

z     360
ak    349
y     324
ay    313
t     306
Name: X0, dtype: int64
aa    833
s     598
b     592
l     590
v     408
Name: X1, dtype: int64
as    1659
ae     496
ai     415
m      367
ak     265
Name: X2, dtype: int64
c    1942
f    1076
a     440
d     290
g     241
Name: X3, dtype: int64
d    4205
a       2
c       1
b       1
Name: X4, dtype: int64
w    231
v    231
q    220
r    215
s    214
Name: X5, dtype: int64
g    1042
j    1039
d     625
i     488
l     478
Name: X6, dtype: int64

In [19]:
len(df['X0'].unique())

47

In [18]:
for i in df.columns:
    print(len(df[i].unique()))

47
27
44
7
4
29
12

In [21]:
df.X1.value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [34]:
list_10=df.X1.value_counts().sort_values(ascending=False).head(10).index
list_10=list(list_10)

In [35]:
for categories in list_10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [36]:
df['X1']

0       v
1       t
2       w
3       t
4       v
       ..
4204    s
4205    o
4206    v
4207    r
4208    r
Name: X1, Length: 4209, dtype: object

In [37]:
list_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [38]:
list_10.append('X1')

In [39]:
df[list_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]